'use strict';
/*
 *  Масиви: літерал масива, елементи, індексація, довжина
 */

/*
? Створіть масив genres з елементами Jazz і Blues.
? Додайте "Рок-н-рол" в кінець.
? Виведіть у консоль перший елемент масиву.
? Виведіть у консоль останній елемент масиву. Код має працювати для масиву довільної довжини.
? Видаліть перший елемент та виведіть його в консоль.
? Вставте «Country» та «Reggy» на початок масиву.
 */


/*
 * Присвоєння за посиланням і за значенням
 */

/*
? Створіть змінну a = 10.
? Створіть та привласніть змінній b -> змінну a
? Виведіть до консолі обидві ці змінні
? Змініть значення змінної a і ще раз виведіть у консоль
*/


/*
? Створіть масив arr1 = [1, 2, 3].
? Створіть та привласніть масиву arr2 -> масив arr1
? Виведіть до консолі обидва цих масива
? Додайте елемент в масив arr1 і ще раз виведете обидва масиви в консоль
*/



/*
 * Перебор масива циклами for та for...of
 */

/*
? Напиши скрипт для перебору масиву fruits циклом for.
? Для кожного елемента масиву виведіть у консоль рядок у форматі номер_елемента: значення_елемента.
? Нумерація елементів має починатися з першого.
*/

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];


/*
? Напиши скрипт пошуку найменшого числа у масиві.
? Код має працювати для будь-якого масиву чисел.
? Використовуйте цикл для вирішення задачі.
*/


/*
? У нас є масив із зарплатами працівників, потрібно порахувати загальну суму зарплат
*/

// const salaries = [200, 450, 600, 150, 300];


/*
? У нас є кілька масивів із зарплатами працівників із різних відділів, потрібно порахувати загальну суму зарплат
*/

// const managerSalaries = [100, 150, 250, 400, 500];
// const developersSalaries = [800, 1500, 4000];



/*
 * Базові методи: split та join, indexOf та includes, push, slice та splice, concat
 */

/*
? Напиши скрипт для обчислення площі прямокутника зі сторонами,
? значення яких зберігаються в змінній values у вигляді рядка.
? Значення гарантовано розділені пробілом.
*/

// const values = '8 11';


/*
? Напиши скрипт, який виводить в консоль ім'я та телефонний номер користувача.
? У змінних names і phones зберігаються рядки імен та телефонних номерів, розділені комами.
? Порядковий номер імен та телефонів у рядках вказують на відповідність.
? Кількість імен та телефонів гарантовано однакова.
*/

// const names = 'Jacob,William,Solomon,Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';



/*
? Напиши скрипт, який «розгортає» рядок (зворотний порядок букв)
? та виводить її в консоль.
*/
// const string = 'Welcome to the future';




/*
? У нас є масив співробітників, відсортуйте його, щоб співробітники не повторювалися
*/

// const employees = ['Dennis', 'Dennis', 'Shaw', 'Watkins', 'Ray', 'Shaw', 'Watkins'];
// const filteredEmployees = [];

/*
1 Ітерація
0 === 0
2 Ітерація
1 === 0
3 Ітерація
2 === 2
4 Ітерація
3 === 3
5 Ітерація
4 === 4
6 Ітерація
5 === 2
7 Ітерація
6 === 3
*/



//? Співробітник Shaw звільнився, видаліть його з масиву


//? Додати нового співробітника Thornton, перед Watkins;





 // ## Example 5 - Массивы и строки

// // Напиши скрипт который выводит в консоль все слова строки кроме первого и
// // последнего. Результирующая строка не должна начинаться или заканчиваться
// // пробельным символом. Скрипт должен работать для любой строки.

// // ```js
// // const string = "Welcome to the future";


// // ```

// // ## Example 6 - Массивы и строки

// // Напиши скрипт который «разворачивает» строку (обратный порядок букв) и выводит
// // ее в консоль.

// // ```js
// // const string = 'Welcome to the future';
// // ```

// // ## Example 7 - Сортировка массива с циклом

// // Напиши скрипт сортировки массива строк в алфавитном порядке по первой букве
// // элемента.

// // ```js
// // const langs = ['python', 'javascript', 'c++', 'haskel', 'php', 'ruby'];
// // ```

// // ## Example 8 - Поиск элемента

// // Напиши скрипт поиска самого маленького числа в массиве. Код должен работать для
// // любого массива чисел. Используй цикл для решения задачи.

// // ```js
// // const numbers = [2, 17, 94, 1, 23, 37];
// // let min;
// // console.log(min); // 1
// // ```

